### Задание 1

Ответьте на вопрос в свободной форме.
Какие преимущества даёт подход IAC?

---

### Решение 1

IAC (Infrastructure as Code) - это процесс управления с помощью машиночитаемых файлов определений, работающий как альтернатива физическому конфигурированию оборудования и оперируемым человеком инструментам.
IaC позволяет запускать скрипт, который может поднять большое количество дополнительных виртуальных машин и автоматически сокращает инфраструктуру до приемлемого вечернего масштаба при необходимости.

---

Задание 2

Выполните действия и приложите скриншоты действий.

1. Установите Ansible.
2. Настройте управляемые виртуальные машины, не меньше двух.
3. Создайте файл inventory. Предлагается использовать файл, размещённый в папке с проектом, а не файл inventory по умолчанию.
4. Проверьте доступность хостов с помощью модуля ping.

---

Решение 2

1.
![Установлена версия 2.10.8](https://github.com/SlavaZakariev/netology/blob/15b9e0cdb8aa2ce143f47055dbcaaf2986aa4bcd/%D0%90%D0%B2%D1%82%D0%BE%D0%BC%D0%B0%D1%82%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F%20%D0%B8%20CI-%D0%A1D/screenshots/Ansible1.1.jpg)

---

Задание 3

Ответьте на вопрос в свободной форме.
Какая разница между параметрами forks и serial?

---

Решение 3

---

Задание 4

В этом задании вы будете работать с Ad-hoc командами.
Выполните действия и приложите скриншоты запуска команд.

1. Установите на управляемых хостах любой пакет, которого нет.
2. Проверьте статус любого, присутствующего на управляемой машине, сервиса.
3. Создайте файл с содержимым «I like Linux» по пути /tmp/netology.txt.

---

Решение 4
